{
  "intro": 
  [
    "Honeydew is a song about doubts and nervous love. It’s about new feelings and old insecurities, being eager to accelerate but hesitant to lose control. We wanted to create something that was just as warm and summery as it is cold and autumnal; a veneer of vintage pop pleasantness masking a melancholy depth.",
    "Here is the full story of how we wrote, recorded and made the artwork for 'Honeydew', as told by Thom."
  ],
    "writing":
  [
    "We first wrote the song in Sam’s bedroom at university. He had a chorus that he liked and some verses that he hated, based on two chords that he thought were super boring. In the end we didn’t change them – all we did was add the synth part over the top, which immediately made the chords much more complex and pretty. Bit of that and some Brides guitars, and we were done. Easy peasy.",
    "The lyrics are a bit of a composite – the chorus is all Sam’s original demo and the verses came later once we’d figured out what the chorus meant. They were written very quickly, but it took me ages to be comfortable with them. I’d just started a relationship after a few years of being very lonely and sad, and I was remembering previous experience, thinking about the doubts and anxieties that come from giving yourself up to a relationship. ‘Am I too self-obsessed to give myself away’ – it’s a love song that’s all about me, and it took me a while to be comfortable with that."
  ],
  "recording": 
  [
    "Just like this was the first Brides song not written by me in my bedroom, it was the first tune that we recorded entirely with an external producer (Gavin Monaghan, Magic Garden Studios). There’s a lot that seeps into a recording from the place it was recorded: we spent a month or so tracking this out on an industrial estate in Wolverhampton in the middle of winter, and I reckon the beauty of our surroundings definitely made its way onto the track. The first couple of songs were done ourselves by sneaking into Jez’s university studio so it definitely made a nice change to be recording on instruments that didn’t have bits missing.",
    "That guitar Sam is playing was an insane moment – it’s a Shergold Masquerader that was originally played by Bernie Sumner on the second Joy Division record. New Order and Joy Divison are massive loves of ours, and ‘Honeydew’ in particular is influenced a lot by them. To be able to actually record it using the same gear they had was absolutely ridiculous, we couldn’t believe it.",
    "I remember being super fucking ill during pretty much the entire process (just a cold, this was a 2019 illness) – I had to take time off work because I could hardly stand, so I mostly just dictated stuff from the sofa while nursing some of Gav’s homemade throat remedies so that I could actually manage a take of vocals.",
    "Mixing the song was a bit of a nightmare. We were just starting the mix when Covid shut everything down, which meant we had to do it all remotely with Joe, the main mixing guru at Magic. The drums in particular were really annoying to get right, for ages we just couldn’t get them to not sound like a fucking Foo Fighters record. I remember there was a point where I was sitting in a field listening to a mix and I was really close to scrapping the whole tune. It took a heroic effort from Joe to get it across the line, and it was definitely worth it. The level up in sound from the last couple of songs is massive – we kind of sound like a band."
  ],
  "artwork": 
  [
    "Just like on the last singles, my brother Joel helped us out on the artwork around the tune. Both of us are really into the Factory Records / Peter Saville aesthetic and, as the song is also a bit of a New Order pastiche, we decided we were allowed to wear our influences on our sleeve art a bit as well.",
    "A lot of the ideas we came up with were heavily based on natural imagery, but presented in an unnatural way. Sam had an idea to have a nice shot of some woods, but with a dead body hidden behind one of the trees. Unfortunately we couldn’t get hold of any dead bodies, so we ended up using a print by Ogawa Kazumasa and trying to make his picture of a blooming flower look as unnatural as possible. Meg was the one who developed the colour palette, which we mapped to the image in order to make it colder and more unnatural. I’m not sure why or when exactly we decided to use floral imagery rather than fruit, which would probably make more sense given the title, but that’s artists for you.",
    "‘Honeydew’ is sort of the end of our first mini era of songs, especially in terms of artistic style. The running concept of the boxes that we’ve used on all three songs so far won’t carry on past this – for the next single we’re planning something completely different. ‘Honeydew’ might be the culmination of our first mini era, but really it’s just part of the prologue to Shai Brides. More, much more, is to come."
  ]
}
